// Задание №7*

// Реализуйте программу «Заметки». 
// В начале программы должен выводиться список доступных заметок – 
// список текстовых файлов в директории программы. 
// Пользователь может выбрать заметку и считать с неё информацию или создать новую заметку. 

// Отправьте преподавателю код программы, скриншот консоли в процессе выполнения, 
// скриншот директории с заметками и скриншот открытой заметки.#include <iostream>

// https://github.com/A-l-E-v/CPP_Synergy/blob/main/U-379/notes.cpp

using namespace std;

int main()
{

}