// Задание №8*

// Реализовать упрощённый вариант стека – структуры, 
// где всегда доступен только последний добавленный элемент. 
// Элементом стека должна быть структура, хранящая целое число и указатель на элемент. 
// Количество элементов и сами элементы пользователь вводит с консоли, 
// после чего они должны быть выведены в корректно порядке. 
// Не забудьте в конце корректно удалить все элементы стека.

// Отправьте преподавателю код программы и скриншот консоли.

// https://github.com/A-l-E-v/CPP_Synergy/blob/main/U-379/stack.cpp

#include <iostream>

using namespace std;

int main()
{

}