// Задание №1

// 	В уроках №2 и №3 Вы познакомились с переменными, в том числе узнали как объявить переменную,
// задать ей значение через консоль и вывести это значение обратно в консоль.
// Для отработки данного навыка создайте несколько переменных основных типов,
// введите их значения через консоль и после выведите все сохранённые значения обратно в консоль.

// 	Протестируйте программу. Сделайте скриншот консоли после выполнения всей
// программы и отправьте его преподавателю.

#include <iostream>

using namespace std;

int main()
{

}